app/controllers/authentication_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "acron.bn@gmail.com"], ["LIMIT", 1]]
---
  def authenticate
    auth_token =
      AuthenticateUser.new(auth_params[:email], auth_params[:password]).call
    if auth_token
      user = User.find_by(email: auth_params[:email])