app/controllers/pets_controller.rb

  def create
    @pet = current_user.pets.create!(pet_params)
---
INSERT INTO "pets" ("name", "animal", "breed", "created_by", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "pedro"], ["animal", "perro"], ["breed", "asdfds"], ["created_by", "1"], ["created_at", 2017-04-28 06:53:36 UTC], ["updated_at", 2017-04-28 06:53:36 UTC]]

  def destroy
    if @pet.post
      @pet.post.destroy
---
DELETE FROM "pets" WHERE "pets"."id" = $1  [["id", 2]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 5]]