app/controllers/posts_controller.rb

  def create
    #@pet.post.create!(post_params)
    if @pet.post == nil
      @post = Post.new(post_params)
      @post.pet_id = @pet.id
      @post.save
---
INSERT INTO "posts" ("title", "content", "active", "pet_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "busco hogar"], ["content", "aklsdfsdf"], ["active", true], ["pet_id", 1], ["created_at", 2017-04-28 06:54:12 UTC], ["updated_at", 2017-04-28 06:54:12 UTC]]

  def set_pet
    @pet = Pet.find(params[:pet_id])
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]